# VendorIdAttribute Class

---
The custom VendorId attribute for Macros macros use only.
SystemObject SystemAttribute Autodesk.Revit.DB.MacrosVendorIdAttribute
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class VendorIdAttribute : Attribute

    Public Class VendorIdAttribute
    	Inherits Attribute

    public ref class VendorIdAttribute : public Attribute

    type VendorIdAttribute =
        class
            inherit Attribute
        end
The VendorIdAttribute type exposes the following members.
| Name| Description
---|---|---
| VendorIdAttribute| Constructs a new VendorIdAttribute.
Top
| Name| Description
---|---|---
| TypeId| When implemented in a derived class, gets a unique identifier for this Attribute.(Inherited from Attribute)
| Value| AddInId VendorId value.
Top
| Name| Description
---|---|---
| Equals| Returns a value that indicates whether this instance is equal to a specified object.(Inherited from Attribute)
| GetHashCode| Returns the hash code for this instance.(Inherited from Attribute)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| IsDefaultAttribute| When overridden in a derived class, indicates whether the value of this instance is the default value for the derived class.(Inherited from Attribute)
| Match| When overridden in a derived class, returns a value that indicates whether this instance equals a specified object.(Inherited from Attribute)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Macros Namespace